export const defaultExperimentInfo = {
  实验简介: [
    {
      UI面板名: "ExperimentIntroductionPanel",
      ExpName: "结核杆菌的培养鉴定及耐药性检测",
      ExpArticlesText:
        "人类免疫缺陷病毒抗体筛查是针对HIV感染的血液学检测，通过检测血液中的HIV抗体来确定是否感染了HIV。此试验用于检测是否存在艾滋病病毒感染，通过抽取血液样本来检测血液中是否存在针对艾滋病毒的抗体。",
      图片: "图片1,图片2,图片3",
      图片路径: "/Experiment_1/Art/ImageTextures/",
      音频: 1,
    },
  ],
  实验原理: [
    {
      UI面板名: "ExperimentTheoryPanel",
      实验原理Name: "酶联免疫吸附试验",
      ExpArticlesText:
        "是指将可溶性的抗原或抗体吸附到聚苯乙烯等固定载体上，进行免疫反应的定性和定量方法。结合在固相载体表面的抗原或抗体保持其免疫学活性，酶标记的抗原或抗体保留免疫学活性同时又保留酶的活性。",
      图片: "图片4",
      图片路径: "/Experiment_1/Art/ImageTextures/",
      音频: 2,
    },
    {
      UI面板名: "ExperimentTheoryPanel",
      实验原理Name: "胶体金实验",
      ExpArticlesText:
        "试纸条包被HIV抗原（如gp41、gp120）和胶体金标记的二抗（抗人IgG）。  样本中的HIV抗体与胶体金标记的二抗结合，形成复合物，沿层析膜移动，在检测线（T线）与固定抗原结合显色。质控线（C线）用于验证试纸条有效性。",
      图片: "图片5",
      图片路径: "/Experiment_2/Art/ImageTextures/",
      音频: 3,
    },
    {
      UI面板名: "ExperimentTheoryPanel",
      实验原理Name: "免疫印迹试验",
      ExpArticlesText:
        "Western Blot采用的是聚丙烯酰胺凝胶电泳，被检测物是蛋白质，“探针”是抗体，“显色”用标记的二抗。经过聚丙烯酰胺凝胶电泳(PAGE)分离的蛋白质样品，通过转膜方式转移到固相载体(如PVDF、NC膜)上，固相载体以非共价键形式吸附蛋白质，且能保持电泳分离的多肽类型及其生物学活性不变。以固相载体上的蛋白质或多肽作为抗原，与对应的抗体起免疫反应，再与酶标记(通常是HRP)的第二抗体起反应，经过底物化学发光试剂(如ECL)发光或显示试剂(如DAB)显色以检测电泳分离的特异性目的基因表达的蛋白成分。",
      图片: "图片6",
      图片路径: "/Experiment_3/Art/ImageTextures/",
      音频: 4,
    },
    {
      UI面板名: "ExperimentTheoryPanel",
      实验原理Name: "流式细胞术",
      ExpArticlesText:
        "利用荧光标记的单克隆抗体（如抗CD3、CD4、CD8）与淋巴细胞表面抗原结合，通过流式细胞仪分析荧光信号，区分并计数CD4+和CD8+ T细胞亚群。关键抗体组合：CD3+CD4+（辅助/诱导T细胞）和CD3+CD8+（细胞毒性T细胞）",
      图片: "图片7",
      图片路径: "/Experiment_4/Art/ImageTextures/",
      音频: 5,
    },
  ],
  实验模拟: [
    {
      UI面板名: "ExperimentSimulationPanel",
      实验原理Name: "样本预处理",
    },
    {
      UI面板名: "ExperimentSimulationPanel",
      实验原理Name: "酶联免疫吸附试验",
    },
    {
      UI面板名: "ExperimentSimulationPanel",
      实验原理Name: "胶体金实验",
    },
    {
      UI面板名: "ExperimentSimulationPanel",
      实验原理Name: "免疫印迹试验",
    },
    {
      UI面板名: "ExperimentSimulationPanel",
      实验原理Name: "流式细胞术",
    },
  ],
  试题库: [],
  实验模拟一: [
    {
      模拟Name: "样本预处理",
      序号: 1,
      步骤Name: "采集",
      描述: "1.采集：让患者握拳，距离穿刺点上方5-10cm处扎止血带，用无菌棉签蘸取消毒液，由内向外螺旋消毒，等待吹干。将无菌棉签放入污物桶。用一次性采血针与皮肤呈15°-30°角，斜面向上，快速刺入静脉，将采血管插入针座，血液自动流入，采5ml的全血后，松开止血带，让患者松拳，用无菌棉签轻压穿刺点，快速拔针。",
      "是否考核点（是填1，否填0）": 1,
      音频: 6,
    },
    {
      模拟Name: "样本预处理",
      序号: 2,
      步骤Name: "标记",
      描述: "2.标记：将采集后的全血用标记笔在试管的表面处写上标记为待测样品。",
      "是否考核点（是填1，否填0）": 0,
      音频: 7,
    },
    {
      模拟Name: "样本预处理",
      序号: 3,
      步骤Name: "处理",
      描述: "3.处理：将用完的一次性采血针放入锐器盒中",
      音频: 8,
    },
    {
      模拟Name: "样本预处理",
      序号: 4,
      步骤Name: "血清分离",
      描述: "4.分离：将待测样品放在试管架上静置30min，然后放入离心机里，将离心机的转速调为3000rpm，时间为10min",
      音频: 9,
    },
    {
      模拟Name: "样本预处理",
      序号: 5,
      步骤Name: "保存",
      描述: "5.保存：将全血分离后的血清用胶头滴管吸取2.5ml后，放在2-8℃的冰箱内保存72h。",
      音频: 10,
    },
  ],
  实验模拟二: [
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 1,
      步骤Name: "稀释",
      描述: "用量筒称取19ml的蒸馏水，倒入离心管中，用加样器吸取1ml的洗涤液，打入装有蒸馏水19ml的离心管中。用加样器吸取500μL的稀释液打入离心管中，再吸取5μL的待测血清，打入装有500μL的稀释液的离心管中。用量筒称取5ml的稀释液，再吸取1μLHRP标记的二抗，打入装有5ml的稀释液离心管中。",
      音频: 11,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 2,
      步骤Name: "加样",
      描述: "用移液器在空白孔中加100μL的样本稀释液，在阴性对照孔中加试剂盒提供的阴性对照血清100μL，在阳性对照孔中加试剂盒提供的阳性对照血清100μL，在待测血清孔中加入100μL的待测血清。",
      音频: 12,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 3,
      步骤Name: "震荡孵育",
      描述: "用封板膜封板后放置在37℃的恒温箱中放置30min从温育箱中拿出酶标包被板，小心揭掉封板膜，弃去酶标包被板中的液体并甩干，将每个孔加300μL洗涤剂，静置30s后，将所有液体弃入水池中，并重复动作五次",
      音频: 13,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 4,
      步骤Name: "加入酶标物",
      描述: "用移液器在每孔中加入HRP标记的二抗100μL，然后放到37℃的恒温箱中放置30min。然后取出来，小心揭掉封板膜，弃去酶标包被板中的液体并甩干，将每个孔加300μL洗涤剂，静置30s后弃入水池中，重复五次",
      音频: 14,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 5,
      步骤Name: "加入底物",
      描述: "用加样器吸取显色剂A50μL，在每孔先加入显色剂A50μL，再用加样器吸取显色剂B50μL，在每孔中加入显色剂B50μL，轻轻振荡混匀，用封板膜封板后，放置在37℃的恒温箱中放置30min",
      音频: 15,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 6,
      步骤Name: "终止反应",
      描述: "小心揭掉封板膜，用加样器吸取终止液50μL，在每孔中加终止液50μL，（发生终止反应，蓝色转变为黄色）",
      音频: 16,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 7,
      步骤Name: "酶标仪比色",
      描述: "打开酶标仪，预热15min，把酶标包被板放入酶标仪，以空白孔调零，用450nm的波长，按顺序测量各孔的吸光度（od值）然后将数据导出。",
      音频: 17,
    },
    {
      模拟Name: "酶联免疫吸附试验",
      序号: 8,
      步骤Name: "结果判断",
      描述: "将待测样本和阴性对照校准之后的OD值与判读标准进行对比，\n若OD样本 / OD临界值 ≥1.0 为阳性，需复测或确认",
      音频: 18,
    },
  ],
  实验模拟三: [
    {
      模拟Name: "胶体金复检",
      序号: 1,
      步骤Name: "加样",
      描述: "用胶头滴管吸取血清，滴加1滴在胶体金试纸上的加样孔中，然后滴加2滴稀释液。",
      音频: 19,
    },
    {
      模拟Name: "胶体金复检",
      序号: 2,
      步骤Name: "观察结果",
      描述: "在室温下静置片刻后，观察试纸的颜色变化。",
      音频: 20,
    },
    {
      模拟Name: "胶体金复检",
      序号: 3,
      步骤Name: "结果判定",
      描述: "若在C位上出现一条红线，则为阴性，若在C和T位上出现两条红线，则为阳性，若在T位上出现一条红线，则为无效。",
      音频: 21,
    },
  ],
  实验模拟四: [
    {
      模拟Name: "免疫印迹试验",
      序号: 1,
      步骤Name: "灌胶验漏",
      描述: "加蒸馏水至短玻璃板上沿，等待2min后来检查液面，若无下降后，则弃掉蒸馏水，若有下降后，则重新组装。",
      音频: 22,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 2,
      步骤Name: "灌制分离胶",
      描述: "用加样器往一个50ml离心管中加入4ml的丙烯酰胺混合液、2.5ml的1.5M Tris-HCl、100μL的10% SDS，然后用加样器混匀10次再加入100μL0%过硫酸铵和10μl的TEMED，然后混匀用加样器吸取胶液1ml，然后沿玻璃板一侧缓慢地注入底部1cm处停止，用加样器缓慢加入500μL的异丙醇后，等待30min",
      音频: 23,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 3,
      步骤Name: "灌制浓缩胶",
      描述: "用加样器往离心管加入0.67ml的30%丙烯酰胺、1.25ml的1.0M Tris-HCl、50μl 10% SDS，50μl的10%过硫酸铵和5μl TEMED，然后混匀倒掉分离胶上的异丙醇，用滤纸吸干残留液体，缓慢地注入到浓缩胶至玻璃板的顶端，然后立即插入梳齿缓慢地插入，然后等待20min",
      音频: 24,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 4,
      步骤Name: "样本处理",
      描述: "取离心管，用加样器吸取10μl待测血清，再加入10μl的2×SDS上样缓冲液然后放置在95℃的水浴锅中加热5min，拿出来后短暂放入离心机中以12000rpm，10s",
      音频: 25,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 5,
      步骤Name: "装胶",
      描述: "将凝胶装置安装到电泳槽中，再在内外槽中加入1×电泳缓冲液，倒至标有2 Gels处位置即可，再垂直缓慢拔出梳齿，同时将上样孔中的气泡赶净",
      音频: 26,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 6,
      步骤Name: "上样",
      描述: "用加样器吸取10μl的样本，枪头伸入加样孔中，但不能刺破胶底部，缓慢推出样本且可以看到样本沉入孔底，再留一孔加预染蛋白Marker，加样结束后，将电泳槽的盖子盖好",
      音频: 27,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 7,
      步骤Name: "电泳",
      描述: "先连接电源，红色对红色，黑色对黑色，接通电源前检查正负极是否正确，用80 V电压用来跑浓缩胶，20min后，直到染料进入分离胶，再调至120 V电压，1h后直到染料到达胶底部停止电泳",
      音频: 28,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 8,
      步骤Name: "处理",
      描述: "结束后，用切胶板切掉上浓缩胶，将废弃胶扔入污物桶中。",
      音频: 29,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 9,
      步骤Name: "转膜",
      描述: "1.首先用平衡液把PVDF膜给浸泡活化10-15s，至呈现出半透明状，同时将滤纸浸泡在封闭皿中装有转膜缓冲液中\n2.将转膜夹取出放置在实验台上，打开转移夹，黑色面朝下，依次放置：海绵垫→浸泡后的滤纸→凝胶→PVDF膜→浸泡后的滤纸→海绵垫，每层都用滚轮轻轻地把气泡赶走组装\n3.夹紧转膜夹：合上夹子，让每层紧密接触，再放入转膜仪的转膜槽中",
      音频: 30,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 10,
      步骤Name: "加转膜缓冲液",
      描述: "在槽内加入预冷的转膜缓冲液",
      音频: 31,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 11,
      步骤Name: "连接电源",
      描述: "凝胶侧为负极，膜侧为正极，恒流电调为200mA，转膜90min",
      音频: 32,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 12,
      步骤Name: "封闭",
      描述: "转膜结束后，用镊子小心的夹取膜的边缘，把膜放在呈有TBST的封闭皿中，再放在摇床上，室温下缓慢的摇动1h",
      音频: 33,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 13,
      步骤Name: "一抗孵育",
      描述: "1.把封闭皿中的TBST倒掉，倒入装有一抗稀释液（一抗：5%脱脂牛奶=1：500）的离心管，在室温下摇床1小时，将膜放入装有TBST的封闭皿中，在摇床上轻柔摇动，洗膜3次，每次5分钟，洗去未结合的一抗",
      音频: 34,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 14,
      步骤Name: "二抗孵育",
      描述: "把封闭皿中的TBST倒掉，倒入装有二抗稀释液（按照抗人IgG抗体：稀释液=1：5000）的离心管，在室温下摇床1小时",
      音频: 35,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 15,
      步骤Name: "加入底物",
      描述: "再次洗涤，将膜放入装有TBST的封闭皿中，在摇床上轻柔摇动，洗膜3次，每次5分钟，彻底去除未结合二抗。",
      音频: 36,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 16,
      步骤Name: "终止反应",
      描述: "用镊子夹住膜边缘，从封闭皿中取出，放在实验台上，将ECL试剂用滴管均匀滴加至完全覆盖，室温下放置2min，然后将膜取出并垂直置于吸水纸上数秒，吸掉多余的ECL试剂，快速将膜置于化学发光成像仪中，将有蛋白一面朝上",
      音频: 37,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 17,
      步骤Name: "结果判定",
      描述: "1. 阳性标准：需同时满足以下条件：至少两条env条带gp160、gp120或gp41\n2. 阴性标准：无任何特异性条带。",
      音频: 38,
    },
    {
      模拟Name: "免疫印迹试验",
      序号: 18,
      步骤Name: "结果阴阳性分析",
      描述: "1.不确定结果：仅出现非典型条带（如仅p24或p31），需结合以下处理：2-4周后重新采样检测。补充核酸检测（NAT）或间接免疫荧光法（IFA）。\n2.假阳性风险：自身免疫疾病（如红斑狼疮）可能导致非特异条带。疫苗临床试验受试者可能出现交叉反应。",
      音频: 39,
    },
    {
      步骤Name: "  ",
    },
  ],
  实验模拟五: [
    {
      模拟Name: "流式细胞术",
      序号: 1,
      步骤Name: "分装全血",
      描述: "用加样器吸取100μl抗凝全血，缓慢垂直加入标记好的流式管底部",
      音频: 40,
    },
    {
      模拟Name: "流式细胞术",
      序号: 2,
      步骤Name: "加入抗体",
      描述: "用加样器吸取抗体10μl, 垂直滴加到流式管中，用加样器混匀3次，盖上管盖。",
      音频: 41,
    },
    {
      模拟Name: "流式细胞术",
      序号: 3,
      步骤Name: "避光孵育",
      描述: "用铝箔纸包裹流式管 ,放入摇床，设置转速50 rpm,窒温下孵育20分钟",
      音频: 42,
    },
    {
      模拟Name: "流式细胞术",
      序号: 4,
      步骤Name: "裂解红细胞",
      描述: "取出红细胞裂解液，用加样器加入2ml至每管，立即涡旋振荡3秒，设置转速2000rpm，避光下在室温静置10分钟",
      音频: 43,
    },
    {
      模拟Name: "流式细胞术",
      序号: 5,
      步骤Name: "离心洗涤",
      描述: "将流式管放入离心机，设置300xg、 4℃离心5分钟，然后慢慢取出管子 ，观察管底应有米粒大小细胞沉淀。上清液应透明 ，若仍有红色需重复裂解。用加样器弃去上清，留约50μl液体",
      音频: 44,
    },
    {
      模拟Name: "流式细胞术",
      序号: 6,
      步骤Name: "PBS洗涤",
      描述: "加入2mL预冷的PBS,用涡旋振荡器混匀3秒，再放离心机里300×g离心5分钟。重复吸弃上清，保留50μl液体。",
      音频: 45,
    },
    {
      模拟Name: "流式细胞术",
      序号: 7,
      步骤Name: "固定细胞",
      描述: "用加样器吸取100μL4%多聚甲醛固定液，轻柔吹吸10次混匀，在避光条件下4℃保存",
      音频: 46,
    },
    {
      模拟Name: "流式细胞术",
      序号: 8,
      步骤Name: "流式细胞仪准备",
      描述: "打开流式细胞仪,打开电脑，启动BD Accuri C6Software软件",
      音频: 47,
    },
    {
      模拟Name: "流式细胞术",
      序号: 9,
      步骤Name: "样本上机",
      描述: "将流式管放入进样器，在软件页面创建散点图",
      音频: 48,
    },
  ],
}
import type { QuestionData } from "@/interface/index"
export const expQuestionData = {
  exp1: {
    step1: [
      {
        question: "使用止血带的时间不宜超过多久？",
        answer: "B",
        type: "radio",
        options: [
          {
            label: "A. 30秒",
            value: "A",
          },
          {
            label: "B. 1分钟",
            value: "B",
          },
          {
            label: "C. 2分钟",
            value: "C",
          },
          {
            label: "D. 5分钟",
            value: "D",
          },
        ],
        tips: "止血带绑扎时间 ≤1分钟，过长会导致血液浓缩、局部淤血或溶血。",
      },
      {
        question: "采血时消毒皮肤的正确方式是？",
        answer: "A",
        type: "radio",
        tips:'以穿刺点为中心，由内向外螺旋式消毒（直径≥5cm），避免重复污染区域。',
        options: [
          {
            label: "A. 由内向外螺旋式擦拭",
            value: "A",
          },
          {
            label: "B. 由外向内画圈擦拭",
            value: "B",
          },
          {
            label: "C. 来回擦拭",
            value: "C",
          },
          {
            label: "D. 点状涂抹",
            value: "D",
          },
        ],
      },
    ],
    step2: [
      {
        question: "静脉采血时，穿刺针头与皮肤的最佳角度是？",
        answer: "B",
        type: "radio",
        options: [
          {
            label: "A. 10°～15°",
            value: "A",
          },
          {
            label: "B. 15°～30°",
            value: "B",
          },
          {
            label: "C. 30°～45°",
            value: "C",
          },
          {
            label: "D. 45°～60°",
            value: "D",
          },
        ],
        tips: "针头斜面向上，以 15°～30° 角度快速刺入皮肤，可减少疼痛和血管损伤。",
      },
    ],
  },
  exp3: {
    step2: [
      {
        question: "请选择血管",
        answer: "静脉",
        type: "radio",
        options: [
          {
            label: "动脉",
            value: "动脉",
          },
          {
            label: "静脉",
            value: "静脉",
          },
        ],
      },
    ],
    step4: [
      {
        question: "请选择穿刺部位",
        answer: "远心端",
        type: "radio",
        options: [
          {
            label: "中端",
            value: "中端",
          },
          {
            label: "近心端",
            value: "近心端",
          },
          {
            label: "远心端",
            value: "远心端",
          },
        ],
      },
    ],
    step7: [
      {
        question: "在家兔的麻醉过程中,可根据哪几项来判断麻醉的深浅(多选)",
        answer: ["A", "C", "E"],
        type: "checkbox",
        options: [
          {
            label: "A.呼吸",
            value: "A",
          },
          {
            label: "B.血压",
            value: "B",
          },
          {
            label: "C.夹捏皮肤反应",
            value: "C",
          },
          {
            label: "D.心率",
            value: "D",
          },
          {
            label: "E.角膜反射",
            value: "E",
          },
        ],
      },
    ],
  },
  exp8: {
    step2: [
      {
        question: "肝素抗凝作用的主要机制是()",
        answer: "A",
        type: "radio",
        options: [
          {
            label: "A、促进抗凝血酶正的活性",
            value: "A",
          },
          {
            label: "B、与钙离子形成络合物",
            value: "B",
          },
          {
            label: "C、收缩血管",
            value: "C",
          },
          {
            label: "D、对抗维生素K的作用",
            value: "D",
          },
          {
            label: "E、激活纤溶系统",
            value: "E",
          },
        ],
      },
    ],
  },
} as Record<string, Record<string, QuestionData[]>>
